In [1]:
import psycopg2
import pandas as pd
from string import Template

In [2]:
# dataname = "small_census_01"
# index = "v1"

In [3]:
dataname = "small_adult_1"
index = "1"

In [4]:
# dataname =  "food_small"
# index = "v1"

### Connect to db

In [5]:
conn = psycopg2.connect(host="localhost",
                        database="{}_{}".format(dataname,index), 
                        user="holocleanuser", 
                        password="abcd1234")

In [6]:
def query_df(q, value = []):
    if len(value) != 0:
        df = pd.read_sql_query(q, conn, params=value)
    else:
        df = pd.read_sql_query(q, conn)
    return df

In [7]:
def table_lists():
    df = query_df("""SELECT table_name FROM information_schema.tables
       WHERE table_schema = 'public'""")
    return df

In [8]:
table_lists()

                table_name
0            small_adult_1
1                 dk_cells
2              cell_domain
3               pos_values
4                     test
5               cell_distr
6           inf_values_idx
7           inf_values_dom
8   small_adult_1_repaired
9      small_adult_1_clean
10                  test_1

In [9]:
df = query_df("select * from small_adult_1")

In [10]:
df.head()

,_tid_,age,workclass,education,maritalstatus,occupation,relationship,race,sex,hoursperweek,country,income
0,0,<18,private,10th,never-married,machine-op-inspct,not-in-family,white,male,40,united-states,lessthan50k
1,1,<18,_nan_,10th,never-married,_nan_,own-child,white,male,40,united-states,lessthan50k
2,2,<18,private,11th,never-married,sales,own-child,white,female,25,united-states,lessthan50k
3,3,<18,private,10th,never-married,sales,own-child,white,female,18-21,united-states,lessthan50k
4,4,<18,_nan_,11th,never-married,_nan_,own-child,white,male,40,united-states,lessthan50k

In [11]:
# get all attributes 
data = query_df("select * from {}".format(dataname))
attributes = data.columns.values[1:]
attributes

array(['age', 'workclass', 'education', 'maritalstatus', 'occupation',
       'relationship', 'race', 'sex', 'hoursperweek', 'country', 'income'],
      dtype=object)

### Total Errors

In [12]:
errors_template = Template('SELECT t1._tid_, t2._attribute_, t1.\"$attr\" as init, t2._value_ as gt '\
                            'FROM $init_table as t1, $grdt_table as t2 '\
                            'WHERE t1._tid_ = t2._tid_ '\
                              'AND t2._attribute_ = \'$attr\' '\
                              'AND t1.\"$attr\" != t2._value_')

In [13]:
def get_total_errors():
    all_error = []
    for attr in attributes:
        query = errors_template.substitute(init_table=dataname, grdt_table='%s_clean'%dataname,
                        attr=attr)
        df = query_df(query)
        all_error.append(df)
    return all_error

In [14]:
all_error = get_total_errors()

In [15]:
all_error = pd.concat(all_error, ignore_index=True)

In [48]:
all_error['_attribute_'].unique()

array(['relationship', 'race', 'sex', 'income'], dtype=object)

In [17]:
vid_template = Template("SELECT * from cell_domain where attribute = \'$attr\' and _tid_ = \'$tid\'")

In [53]:
query_df(vid_template.substitute(attr='income', tid=609))

,_cid_,_tid_,_vid_,attribute,domain,domain_size,fixed,init_index,init_value
0,6709,609,2777,income,lessthan5k0,1,1,0,lessthan5k0

In [19]:
init_count = all_error.shape[0]
init_count

321

### Total Repair

In [20]:
query = "SELECT t1._tid_, t1.attribute, t1.init_value as init, t2.rv_value as repair " \
                 "FROM %s as t1, %s as t2 " \
                 "WHERE t1._tid_ = t2._tid_ " \
                   "AND t1.attribute = t2.attribute " \
                   "AND t1.init_value != t2.rv_value"\
                %('cell_domain', 'inf_values_dom')
all_repair = query_df(query)

In [21]:
all_repair.head()

   _tid_      attribute       init         repair
0     29      workclass  local-gov        private
1     78      workclass  local-gov        private
2     85      workclass  local-gov        private
3     90  maritalstatus    widowed  never-married
4    112      workclass  local-gov        private

In [22]:
total_repair_init_count = all_repair.shape[0]
total_repair_init_count

108

In [23]:
query = "SELECT t1._tid_, t1.attribute, t1.init_value as init, t2.rv_value as repair " \
         "FROM %s as t1, %s as t2, %s as t3 " \
         "WHERE t1._tid_ = t2._tid_ " \
           "AND t1.attribute = t2.attribute " \
           "AND t1.init_value != t2.rv_value " \
           "AND t1._tid_ = t3._tid_ " \
           "AND t1.attribute = t3._attribute_"\
        %('cell_domain', 'inf_values_dom', '%s_clean'%dataname)
repair_gt = query_df(query)

In [50]:
repair_gt.head()

   _tid_      attribute       init         repair
0     29      workclass  local-gov        private
1     78      workclass  local-gov        private
2     85      workclass  local-gov        private
3     90  maritalstatus    widowed  never-married
4    112      workclass  local-gov        private

In [30]:
repair_gt_init_count = repair_gt.shape[0]
repair_gt_init_count

108

### Correct Repair

In [31]:
correct_repairs_template = Template('SELECT errors._tid_, errors._attribute_, '\
                            ' errors.init, errors._value_ as gt, repairs.rv_value as repair FROM'\
                            '(SELECT t2._tid_, t2._attribute_, t2._value_, t1.\"$attr\" as init '\
                             'FROM $init_table as t1, $grdt_table as t2 '\
                             'WHERE t1._tid_ = t2._tid_ '\
                               'AND t2._attribute_ = \'$attr\' '\
                               'AND t1.\"$attr\" != t2._value_ ) as errors, $inf_dom as repairs '\
                              'WHERE errors._tid_ = repairs._tid_ '\
                                'AND errors._attribute_ = repairs.attribute '\
                                'AND errors._value_ = repairs.rv_value')

In [32]:
def get_total_repair():
    all_rp = []
    for attr in attributes:
        query = correct_repairs_template.substitute(init_table=dataname, grdt_table='%s_clean'%dataname, 
                                            inf_dom = 'inf_values_dom', attr=attr)
        df = query_df(query)
        all_rp.append(df)
    return all_rp

In [33]:
all_repair_gt = get_total_repair()

In [34]:
all_repair_gt = pd.concat(all_repair_gt, ignore_index=True)

In [35]:
all_repair_gt.head(30)

Empty DataFrame
Columns: [_tid_, _attribute_, init, gt, repair]
Index: []

In [36]:
all_repair_gt.shape[0]

0

### wrong repair correctly detected

In [37]:
wrong_repairs_template = Template('SELECT errors._tid_, errors._attribute_, '\
                            ' errors.init, errors._value_ as gt, repairs.rv_value as repair FROM'\
                            '(SELECT t2._tid_, t2._attribute_, t2._value_, t1.\"$attr\" as init '\
                             'FROM $init_table as t1, $grdt_table as t2 '\
                             'WHERE t1._tid_ = t2._tid_ '\
                               'AND t2._attribute_ = \'$attr\' '\
                               'AND t1.\"$attr\" != t2._value_ ) as errors, $inf_dom as repairs '\
                              'WHERE errors._tid_ = repairs._tid_ '\
                                'AND errors._attribute_ = repairs.attribute '\
                                'AND errors._value_ <> repairs.rv_value')

In [38]:
def get_total_wrong_repair():
    all_rp = []
    for attr in attributes:
        query = wrong_repairs_template.substitute(init_table=dataname, grdt_table='%s_clean'%dataname, 
                                            inf_dom = 'inf_values_dom', attr=attr)
        df = query_df(query)
        all_rp.append(df)
    return all_rp

In [39]:
wrong_repair_gt = get_total_wrong_repair()

In [40]:
wrong_repair_gt = pd.concat(wrong_repair_gt, ignore_index=True)

In [41]:
wrong_repair_gt

  _tid_   _attribute_       init             gt     repair
0  1975  relationship  own-child  not-in-family  own-child
1  1512           sex       male         female       male

### Detected Errors

In [42]:
query = "SELECT t1._tid_, t1.init_value as init, t2._value_ as gt " \
        "FROM %s as t1, %s as t2, %s as t3 " \
        "WHERE t1._tid_ = t2._tid_ AND t1._cid_ = t3._cid_ " \
        "AND t1.attribute = t2._attribute_ " \
        "AND t1.init_value != t2._value_" \
        % ('cell_domain', '%s_clean'%dataname, 'dk_cells')

In [43]:
init_error = query_df(query)

In [44]:
init_error.shape[0]

109

In [45]:
init_error.head(10)

   _tid_            init             gt
0   1512            male         female
1   1975       own-child  not-in-family
2    609     lessthan5k0    lessthan50k
3    619    lnessthan50k    lessthan50k
4    628      lessthn50k    lessthan50k
5    650    leqssthan50k    lessthan50k
6    656      lessthan0k    lessthan50k
7    657  lessthan50k***    lessthan50k
8    734      lssthan50k    lessthan50k
9    735     lesstha5n0k    lessthan50k